vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM14ZA5_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs='http://www.w3.org/2001/XMLSchema-instance' xs:noNamespaceSchemaLocation='PACK.xsd' schemaVersion='1.4'>
  <name>MKM14ZA5_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKM14ZA5</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version='25.06.00' date='2025-06-24'>NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version='25.03.00' date='2025-03-28'>NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version='19.0.0' date='2024-07-17'>NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version='18.0.0' date='2024-01-14'>NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version='17.0.0' date='2023-07-27'>NXP CMSIS Packs based on MCUXpresso SDK 2.14.0</release>
    <release version='16.0.0' date='2023-01-16'>NXP CMSIS Packs based on MCUXpresso SDK 2.13.0</release>
    <release version='15.0.0' date='2022-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.12.0</release>
    <release version='14.0.0' date='2022-01-05'>NXP CMSIS Packs based on MCUXpresso SDK 2.11.0</release>
    <release version='13.0.0' date='2021-07-13'>NXP CMSIS Packs based on MCUXpresso SDK 2.10.0</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name='CMSIS' vendor='ARM' version='6.1.0'/>
    </packages>
    <languages>
      <language name='C' version='99'/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily='MKM14ZA5' Dvendor='NXP:11'>
      <description>
        Kinetis KM14-50 MHz Mainstream Precision Metrology Microcontrollers based on Arm® Cortex®-M0+
      </description>
      <device Dname='MKM14Z64Axxx5'>
        <processor Dcore='Cortex-M0+' Dfpu='NO_FPU' Dmpu='NO_MPU' Dendian='Little-endian' Dclock='50000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MKM14ZA5/iar/MKM14Z64Axxx5_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x010000' access='rx' default='1' startup='1'/>
        <memory name='SRAM' start='0x1ffff000' size='0x4000' access='rw' default='1'/>
        <algorithm name='devices/MKM14ZA5/arm/MKMP64_1KB.FLM' start='0x00000000' size='0x00010000' RAMstart='0x20000000' RAMsize='0x00001000' default='1'/>
        <debug svd='devices/MKM14ZA5/MKM14ZA5.xml'/>
        <variant Dvariant='MKM14Z64ACHH5'>
          <compile header='devices/MKM14ZA5/fsl_device_registers.h' define='CPU_MKM14Z64ACHH5'/>
        </variant>
      </device>
      <device Dname='MKM14Z128Axxx5'>
        <processor Dcore='Cortex-M0+' Dfpu='NO_FPU' Dmpu='NO_MPU' Dendian='Little-endian' Dclock='50000000'/>
        <environment name='iar'>
          <file category='linkerfile' name='devices/MKM14ZA5/iar/MKM14Z128Axxx5_flash.icf'/>
        </environment>
        <memory name='PROGRAM_FLASH' start='0x00000000' size='0x020000' access='rx' default='1' startup='1'/>
        <memory name='SRAM' start='0x1ffff000' size='0x4000' access='rw' default='1'/>
        <algorithm name='devices/MKM14ZA5/arm/MKMP128_1KB.FLM' start='0x00000000' size='0x00020000' RAMstart='0x20000000' RAMsize='0x00001000' default='1'/>
        <debug svd='devices/MKM14ZA5/MKM14ZA5.xml'/>
        <variant Dvariant='MKM14Z128ACHH5'>
          <compile header='devices/MKM14ZA5/fsl_device_registers.h' define='CPU_MKM14Z128ACHH5'/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id='device.MKM14ZA5.internal_condition'>
      <accept Dname='MKM14Z64ACHH5' Dvendor='NXP:11'/>
      <accept Dname='MKM14Z128ACHH5' Dvendor='NXP:11'/>
    </condition>
    <condition id='cmake_toolchain.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.device=MKM14ZA5.internal_condition'>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.Legacy_flash_adapter.condition_id'>
      <require condition='allOf.driver.flash, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.flash, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.cmsis_drivers.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.flash_adapter.condition_id'>
      <require condition='allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=allOf=component.Legacy_flash_adapter, driver.flash, device=MKM14ZA5.internal_condition'>
      <require condition='anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.Legacy_flash_adapter, driver.flash.internal_condition'>
      <accept condition='allOf.component.Legacy_flash_adapter, driver.flash.internal_condition'/>
    </condition>
    <condition id='allOf.component.Legacy_flash_adapter, driver.flash.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='Legacy_flash_adapter'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='flash'/>
    </condition>
    <condition id='component.lists.condition_id'>
      <require condition='allOf.driver.common, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.log.condition_id'>
      <require condition='allOf.driver.common, utility.str, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, utility.str, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='str'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.log.backend.debug_console_lite.condition_id'>
      <require condition='allOf.component.log, driver.common, utility.debug_console_lite, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, utility.debug_console_lite, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.log.backend.ringbuffer.condition_id'>
      <require condition='allOf.component.log, driver.common, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.component.log, driver.common, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='log'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.lptmr_adapter.condition_id'>
      <require condition='allOf.driver.lptmr, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.lptmr, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lptmr'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.panic.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.pit_adapter.condition_id'>
      <require condition='allOf.driver.pit, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.pit, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='pit'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.serial_manager.condition_id'>
      <require condition='allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual, component.lists, driver.common, device=MKM14ZA5.internal_condition'>
      <require condition='anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='lists'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.component.serial_manager_swo, component.serial_manager_uart, component.serial_manager_virtual.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <accept Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual'/>
    </condition>
    <condition id='component.serial_manager_swo.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='component.serial_manager_uart.condition_id'>
      <require condition='allOf.anyOf=driver.uart, component.uart_adapter, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.anyOf=driver.uart, component.uart_adapter, device=MKM14ZA5.internal_condition'>
      <require condition='anyOf.driver.uart.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='anyOf.driver.uart.internal_condition'>
      <accept Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
    </condition>
    <condition id='component.serial_manager_virtual.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
