vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM14ZA5_DFP.pdsc
    <condition id='component.uart_adapter.condition_id'>
      <require condition='allOf.driver.uart, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.uart, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='device.CMSIS.condition_id'>
      <require condition='allOf.CMSIS_Include_core_cm, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Include_core_cm, device=MKM14ZA5.internal_condition'>
      <require Cclass='CMSIS' Cgroup='CORE'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'>
      <accept Dname='MKM14Z64ACHH5' Dvendor='NXP:11'/>
      <accept Dname='MKM14Z128ACHH5' Dvendor='NXP:11'/>
    </condition>
    <condition id='device.RTE.condition_id'>
      <require condition='allOf.device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.dma, driver.dmamux.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.dma, driver.dmamux.internal_condition'>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dma'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux'/>
    </condition>
    <condition id='device.linker.condition_id'>
      <require condition='allOf.device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='device_ids.MKM14Z64Axxx5.internal_condition'>
      <accept Dname='MKM14Z64ACHH5' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MKM14Z64Axxx5.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MKM14Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.mdk.internal_condition'>
      <accept Tcompiler='ARMCC'/>
    </condition>
    <condition id='device_ids.MKM14Z128Axxx5.internal_condition'>
      <accept Dname='MKM14Z128ACHH5' Dvendor='NXP:11'/>
    </condition>
    <condition id='allOf.toolchains=mdk, device_ids=MKM14Z128Axxx5.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
      <require condition='device_ids.MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MKM14Z64Axxx5.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MKM14Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.armgcc.internal_condition'>
      <accept Tcompiler='GCC'/>
    </condition>
    <condition id='allOf.toolchains=armgcc, device_ids=MKM14Z128Axxx5.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
      <require condition='device_ids.MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MKM14Z64Axxx5.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MKM14Z64Axxx5.internal_condition'/>
    </condition>
    <condition id='toolchains.iar.internal_condition'>
      <accept Tcompiler='IAR'/>
    </condition>
    <condition id='allOf.toolchains=iar, device_ids=MKM14Z128Axxx5.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
      <require condition='device_ids.MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='device.project_template.condition_id'>
      <require condition='allOf.component.uart_adapter, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, device.startup, driver.clock, driver.common, driver.gpio, driver.irtc, driver.port, driver.smc, driver.uart, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='allOf.component.uart_adapter, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, device.startup, driver.clock, driver.common, driver.gpio, driver.irtc, driver.port, driver.smc, driver.uart, anyOf=allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='Startup' Csub=''/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='clock'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='gpio'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='rtc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='port'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='smc'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
    <condition id='anyOf.allOf=component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config, allOf=utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <accept condition='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'/>
      <accept condition='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'/>
    </condition>
