vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM14ZA5_DFP.pdsc
    <condition id='allOf.component.serial_manager, component.serial_manager_uart, utility.assert, utility.debug_console, utility.debug_console_template_config.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug console template config'/>
    </condition>
    <condition id='allOf.utility.assert_lite, utility.debug_console_lite.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='assert_lite'/>
      <require Cclass='Device' Cgroup='SDK Utilities' Csub='debug_console_lite'/>
    </condition>
    <condition id='device.startup.condition_id'>
      <require condition='allOf.device.system, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.device.system, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MKM14ZA5_system'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=iar.condition_id'>
      <require condition='toolchains.iar.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=armgcc.condition_id'>
      <require condition='toolchains.armgcc.internal_condition'/>
    </condition>
    <condition id='allOf.toolchains=mdk.condition_id'>
      <require condition='toolchains.mdk.internal_condition'/>
    </condition>
    <condition id='device.system.condition_id'>
      <require condition='allOf.device.CMSIS, device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.device.CMSIS, device=MKM14ZA5.internal_condition'>
      <require Cclass='Device' Cgroup='CMSIS' Csub='MKM14ZA5_header'/>
      <require condition='device.MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='driver.adc16.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.afe.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.clock.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='driver.cmp.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.cmsis_i2c.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.i2c_dma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.I2C, device.RTE, driver.i2c, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.i2c_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='I2C' Capiversion='2.4.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='i2c_dma'/>
    </condition>
    <condition id='driver.cmsis_spi.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.spi_dma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.SPI, device.RTE, driver.spi, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.spi_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='SPI' Capiversion='2.3.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='spi_dma'/>
    </condition>
    <condition id='driver.cmsis_uart.condition_id'>
      <require condition='allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.uart_dma.internal_condition'/>
    </condition>
    <condition id='allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5, driver.uart_dma.internal_condition'>
      <require Cclass='CMSIS Driver' Cgroup='USART' Capiversion='2.4.0'/>
      <require Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='uart_dma'/>
    </condition>
    <condition id='driver.common.condition_id'>
      <require condition='allOf.device=MKM14ZA5.internal_condition'/>
    </condition>
    <condition id='allOf.cores=cm0p.condition_id'>
      <require condition='cores.cm0p.internal_condition'/>
    </condition>
    <condition id='cores.cm0p.internal_condition'>
      <accept Dcore='Cortex-M0+'/>
    </condition>
    <condition id='driver.crc.condition_id'>
      <require condition='allOf.driver.common, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='driver.dma.condition_id'>
      <require condition='allOf.driver.common, driver.dmamux, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
    <condition id='allOf.driver.common, driver.dmamux, device_id=MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='common'/>
      <require Cclass='Device' Cgroup='SDK Drivers' Csub='dmamux'/>
      <require condition='device_id.MKM14Z64Axxx5, MKM14Z128Axxx5.internal_condition'/>
    </condition>
