vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM14ZA5_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_swo' Cversion='1.0.0' condition='component.serial_manager_swo.condition_id'>
      <description>Component serial_manager_swo</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_SWO
#define SERIAL_PORT_TYPE_SWO 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_swo.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_swo.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_uart' Cversion='1.0.0' condition='component.serial_manager_uart.condition_id'>
      <description>Component serial_manager_uart</description>
      <RTE_Components_h>
#ifndef SERIAL_PORT_TYPE_UART
#define SERIAL_PORT_TYPE_UART 1
#endif
</RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_uart.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_uart.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='serial_manager_virtual' Cversion='1.0.0' condition='component.serial_manager_virtual.condition_id'>
      <description>Component serial_manager_virtual</description>
      <RTE_Components_h>
        #ifndef SSERIAL_PORT_TYPE_VIRTUAL
        #define SSERIAL_PORT_TYPE_VIRTUAL 1
        #endif
        #ifndef DEBUG_CONSOLE_TRANSFER_NON_BLOCKING
        #define DEBUG_CONSOLE_TRANSFER_NON_BLOCKING 1
        #endif
      </RTE_Components_h>
      <files>
        <file category='header' name='components/serial_manager/fsl_component_serial_port_virtual.h' projectpath='component/serial_manager'/>
        <file category='sourceC' name='components/serial_manager/fsl_component_serial_port_virtual.c' projectpath='component/serial_manager'/>
        <file category='include' name='components/serial_manager/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='uart_adapter' Cversion='1.0.0' condition='component.uart_adapter.condition_id'>
      <description>Component uart_adapter</description>
      <files>
        <file category='header' name='components/uart/fsl_adapter_uart.h' projectpath='component/uart'/>
        <file category='sourceC' name='components/uart/fsl_adapter_uart.c' projectpath='component/uart'/>
        <file category='include' name='components/uart/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MKM14ZA5_header' Cversion='1.0.0' condition='device.CMSIS.condition_id'>
      <description>Device MKM14ZA5_cmsis</description>
      <files>
        <file category='header' name='devices/MKM14ZA5/fsl_device_registers.h' projectpath='device'/>
        <file category='header' name='devices/MKM14ZA5/MKM14ZA5.h' projectpath='device'/>
        <file category='header' name='devices/MKM14ZA5/MKM14ZA5_features.h' projectpath='device'/>
        <file category='header' name='devices/MKM14ZA5/MKM14ZA5_COMMON.h' projectpath='device'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_ADC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_AFE.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_AIPS.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_CMP.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_CRC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_DMA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_DMAMUX.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_EWM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_FTFA.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_GPIO.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_I2C.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_LCD.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_LLWU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_LPTMR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_MCG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_MCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_MTB.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_MTBDWT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_NV.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_OSC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_PIT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_PMC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_PORT.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_RCM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_RNG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_ROM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_RTC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_SIM.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_SMC.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_SPI.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_SYSMPU.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_TMR.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_UART.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_VREF.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_WDOG.h' projectpath='device/periph'/>
        <file category='header' name='devices/MKM14ZA5/periph/PERI_XBAR.h' projectpath='device/periph'/>
        <file category='include' name='devices/MKM14ZA5/'/>
        <file category='include' name='devices/MKM14ZA5/periph/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Project Template' Csub='RTE_Device' Cversion='1.0.0' condition='device.RTE.condition_id'>
      <description>Rte_device</description>
      <files>
        <file category='header' attr='config' name='devices/MKM14ZA5/template/RTE_Device.h' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MKM14ZA5/template/'/>
      </files>
    </component>
