vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKM14ZA5_DFP.pdsc
    <component Cclass='Device' Cgroup='SDK Utilities' Csub='MKM14ZA5_linker' Cversion='1.0.0' condition='device.linker.condition_id'>
      <description>Device MKM14ZA5_linker</description>
      <files>
        <file condition='allOf.toolchains=mdk, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/arm/MKM14Z64Axxx5_flash.scf' version='1.0.0' projectpath='MKM14ZA5/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/arm/MKM14Z64Axxx5_ram.scf' version='1.0.0' projectpath='MKM14ZA5/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/arm/MKM14Z128Axxx5_flash.scf' version='1.0.0' projectpath='MKM14ZA5/arm'/>
        <file condition='allOf.toolchains=mdk, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/arm/MKM14Z128Axxx5_ram.scf' version='1.0.0' projectpath='MKM14ZA5/arm'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/gcc/MKM14Z64Axxx5_flash.ld' version='1.0.0' projectpath='MKM14ZA5/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/gcc/MKM14Z64Axxx5_ram.ld' version='1.0.0' projectpath='MKM14ZA5/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/gcc/MKM14Z128Axxx5_flash.ld' version='1.0.0' projectpath='MKM14ZA5/gcc'/>
        <file condition='allOf.toolchains=armgcc, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/gcc/MKM14Z128Axxx5_ram.ld' version='1.0.0' projectpath='MKM14ZA5/gcc'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/iar/MKM14Z64Axxx5_flash.icf' version='1.0.0' projectpath='MKM14ZA5/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM14Z64Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/iar/MKM14Z64Axxx5_ram.icf' version='1.0.0' projectpath='MKM14ZA5/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/iar/MKM14Z128Axxx5_flash.icf' version='1.0.0' projectpath='MKM14ZA5/iar'/>
        <file condition='allOf.toolchains=iar, device_ids=MKM14Z128Axxx5.condition_id' category='linkerScript' attr='config' name='devices/MKM14ZA5/iar/MKM14Z128Axxx5_ram.icf' version='1.0.0' projectpath='MKM14ZA5/iar'/>
      </files>
    </component>
    <component Cclass='Board Support' Cgroup='SDK Project Template' Csub='project_template' Cvariant='MKM14ZA5' Cversion='1.0.0' condition='device.project_template.condition_id' isDefaultVariant='1'>
      <description>Devices_project_template MKM14ZA5</description>
      <files>
        <file category='header' attr='config' name='devices/MKM14ZA5/project_template/board.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM14ZA5/project_template/board.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM14ZA5/project_template/clock_config.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM14ZA5/project_template/clock_config.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM14ZA5/project_template/pin_mux.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM14ZA5/project_template/pin_mux.c' version='1.0.0' projectpath='board'/>
        <file category='header' attr='config' name='devices/MKM14ZA5/project_template/peripherals.h' version='1.0.0' projectpath='board'/>
        <file category='sourceC' attr='config' name='devices/MKM14ZA5/project_template/peripherals.c' version='1.0.0' projectpath='board'/>
        <file category='include' name='devices/MKM14ZA5/project_template/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='Startup' Csub='' Cversion='1.0.0' condition='device.startup.condition_id'>
      <description>Device MKM14ZA5_startup</description>
      <files>
        <file condition='allOf.toolchains=iar.condition_id' category='sourceAsm' attr='config' name='devices/MKM14ZA5/iar/startup_MKM14ZA5.s' version='1.0.0' projectpath='startup/iar'/>
        <file condition='allOf.toolchains=armgcc.condition_id' category='sourceAsm' attr='config' name='devices/MKM14ZA5/gcc/startup_MKM14ZA5.S' version='1.0.0' projectpath='startup/gcc'/>
        <file condition='allOf.toolchains=mdk.condition_id' category='sourceAsm' attr='config' name='devices/MKM14ZA5/arm/startup_MKM14ZA5.S' version='1.0.0' projectpath='startup/arm'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='CMSIS' Csub='MKM14ZA5_system' Cversion='1.0.0' condition='device.system.condition_id'>
      <description>Device MKM14ZA5_system</description>
      <files>
        <file category='sourceC' name='devices/MKM14ZA5/system_MKM14ZA5.c' projectpath='device'/>
        <file category='header' name='devices/MKM14ZA5/system_MKM14ZA5.h' projectpath='device'/>
        <file category='include' name='devices/MKM14ZA5/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='adc' Cversion='2.3.0' condition='driver.adc16.condition_id'>
      <description>ADC16 Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM14ZA5/drivers/fsl_adc16.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM14ZA5/drivers/fsl_adc16.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='afe' Cversion='2.0.3' condition='driver.afe.condition_id'>
      <description>AFE Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM14ZA5/drivers/fsl_afe.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM14ZA5/drivers/fsl_afe.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='clock' Cversion='2.0.1' condition='driver.clock.condition_id'>
      <description>Clock Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM14ZA5/drivers/fsl_clock.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM14ZA5/drivers/fsl_clock.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='Device' Cgroup='SDK Drivers' Csub='cmp' Cversion='2.0.3' condition='driver.cmp.condition_id'>
      <description>CMP Driver</description>
      <files>
        <file category='sourceC' name='devices/MKM14ZA5/drivers/fsl_cmp.c' projectpath='drivers'/>
        <file category='header' name='devices/MKM14ZA5/drivers/fsl_cmp.h' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='I2C' Csub='i2c_cmsis' Cversion='2.2.0' Capiversion='2.3.0' condition='driver.cmsis_i2c.condition_id'>
      <description>I2C CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MKM14ZA5/cmsis_drivers/fsl_i2c_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM14ZA5/cmsis_drivers/fsl_i2c_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/cmsis_drivers/'/>
      </files>
    </component>
    <component Cclass='CMSIS Driver' Cgroup='SPI' Csub='spi_cmsis' Cversion='2.3.0' Capiversion='2.2.0' condition='driver.cmsis_spi.condition_id'>
      <description>SPI CMSIS Driver</description>
      <files>
        <file category='header' name='devices/MKM14ZA5/cmsis_drivers/fsl_spi_cmsis.h' projectpath='drivers'/>
        <file category='sourceC' name='devices/MKM14ZA5/cmsis_drivers/fsl_spi_cmsis.c' projectpath='drivers'/>
        <file category='include' name='devices/MKM14ZA5/cmsis_drivers/'/>
      </files>
    </component>
